<a href="https://colab.research.google.com/github/KodumuruRaja/Feature-Engineering/blob/main/Feature-Engineering-(All%20Categorical-Encoding%20Techniques).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Handling Categorical Features**
# **1) One Hot Encoding**

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
df=pd.read_csv("/content/titanic.csv",usecols=['Sex'])

In [ ]:
df.head()

      Sex
0    male
1  female
2  female
3  female
4    male

In [ ]:
pd.get_dummies(df).head()

   Sex_female  Sex_male
0           0         1
1           1         0
2           1         0
3           1         0
4           0         1

In [ ]:
pd.get_dummies(df,drop_first=True).head()

   Sex_male
0         1
1         0
2         0
3         0
4         1

In [ ]:
df=pd.read_csv("/content/titanic.csv",usecols=['Embarked'])

In [ ]:
df.head()

  Embarked
0        S
1        C
2        S
3        S
4        S

In [ ]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [ ]:
df.dropna(inplace=True)

In [ ]:
df['Embarked'].unique()

array(['S', 'C', 'Q'], dtype=object)

In [ ]:
pd.get_dummies(df).head()

   Embarked_C  Embarked_Q  Embarked_S
0           0           0           1
1           1           0           0
2           0           0           1
3           0           0           1
4           0           0           1

In [ ]:
pd.get_dummies(df,drop_first=True).head()

   Embarked_Q  Embarked_S
0           0           1
1           0           0
2           0           1
3           0           1
4           0           1

# **One Hot Encoding with many categories in a feature**

In [ ]:
df=pd.read_csv("/content/mercedes.csv",usecols=['X0','X1','X2','X3','X4','X5','X6'])

In [ ]:
df.head()

   X0 X1  X2 X3 X4 X5 X6
0   k  v  at  a  d  u  j
1   k  t  av  e  d  y  l
2  az  w   n  c  d  x  j
3  az  t   n  f  d  x  l
4  az  v   n  f  d  h  d

In [ ]:
df['X0'].value_counts()

z     360
ak    349
y     324
ay    313
t     306
x     300
o     269
f     227
n     195
w     182
j     181
az    175
aj    151
s     106
ap    103
h      75
d      73
al     67
v      36
af     35
m      34
ai     34
e      32
ba     27
at     25
a      21
ax     19
am     18
aq     18
i      18
u      17
aw     16
l      16
ad     14
b      11
k      11
au     11
r      10
as     10
bc      6
ao      4
c       3
aa      2
q       2
ab      1
ac      1
g       1
Name: X0, dtype: int64

In [ ]:
df['X0'].unique()

array(['k', 'az', 't', 'al', 'o', 'w', 'j', 'h', 's', 'n', 'ay', 'f', 'x',
       'y', 'aj', 'ak', 'am', 'z', 'q', 'at', 'ap', 'v', 'af', 'a', 'e',
       'ai', 'd', 'aq', 'c', 'aa', 'ba', 'as', 'i', 'r', 'b', 'ax', 'bc',
       'u', 'ad', 'au', 'm', 'l', 'aw', 'ao', 'ac', 'g', 'ab'],
      dtype=object)

In [ ]:
len(df['X0'].unique())

47

In [ ]:
for i in df.columns:
  print(df[i].unique())

['k' 'az' 't' 'al' 'o' 'w' 'j' 'h' 's' 'n' 'ay' 'f' 'x' 'y' 'aj' 'ak' 'am'
 'z' 'q' 'at' 'ap' 'v' 'af' 'a' 'e' 'ai' 'd' 'aq' 'c' 'aa' 'ba' 'as' 'i'
 'r' 'b' 'ax' 'bc' 'u' 'ad' 'au' 'm' 'l' 'aw' 'ao' 'ac' 'g' 'ab']
['v' 't' 'w' 'b' 'r' 'l' 's' 'aa' 'c' 'a' 'e' 'h' 'z' 'j' 'o' 'u' 'p' 'n'
 'i' 'y' 'd' 'f' 'm' 'k' 'g' 'q' 'ab']
['at' 'av' 'n' 'e' 'as' 'aq' 'r' 'ai' 'ak' 'm' 'a' 'k' 'ae' 's' 'f' 'd'
 'ag' 'ay' 'ac' 'ap' 'g' 'i' 'aw' 'y' 'b' 'ao' 'al' 'h' 'x' 'au' 't' 'an'
 'z' 'ah' 'p' 'am' 'j' 'q' 'af' 'l' 'aa' 'c' 'o' 'ar']
['a' 'e' 'c' 'f' 'd' 'b' 'g']
['d' 'b' 'c' 'a']
['u' 'y' 'x' 'h' 'g' 'f' 'j' 'i' 'd' 'c' 'af' 'ag' 'ab' 'ac' 'ad' 'ae'
 'ah' 'l' 'k' 'n' 'm' 'p' 'q' 's' 'r' 'v' 'w' 'o' 'aa']
['j' 'l' 'd' 'h' 'i' 'a' 'g' 'c' 'k' 'e' 'f' 'b']

In [ ]:
for i in df.columns:
  print(len(df[i].unique()))

47
27
44
7
4
29
12

In [ ]:
df.X1.value_counts()

aa    833
s     598
b     592
l     590
v     408
r     251
i     203
a     143
c     121
o      82
w      52
z      46
u      37
e      33
m      32
t      31
h      29
f      23
y      23
j      22
n      19
k      17
p       9
g       6
q       3
ab      3
d       3
Name: X1, dtype: int64

In [ ]:
df.X1.value_counts().sort_values(ascending=False).head(10)

aa    833
s     598
b     592
l     590
v     408
r     251
i     203
a     143
c     121
o      82
Name: X1, dtype: int64

In [ ]:
df.X1.value_counts().sort_values(ascending=False).head(10).index

Index(['aa', 's', 'b', 'l', 'v', 'r', 'i', 'a', 'c', 'o'], dtype='object')

In [ ]:
lst_10=df.X1.value_counts().sort_values(ascending=False).head(10).index
lst_10=list(lst_10)

In [ ]:
lst_10

['aa', 's', 'b', 'l', 'v', 'r', 'i', 'a', 'c', 'o']

In [ ]:
# Only top 10 categories gets replaced by 1 and all others are replaced with 0
for categories in lst_10:
  df[categories]=np.where(df['X1']==categories,1,0)

In [ ]:
df

      X0 X1  X2 X3 X4  X5 X6  aa  s  b  l  v  r  i  a  c  o
0      k  v  at  a  d   u  j   0  0  0  0  1  0  0  0  0  0
1      k  t  av  e  d   y  l   0  0  0  0  0  0  0  0  0  0
2     az  w   n  c  d   x  j   0  0  0  0  0  0  0  0  0  0
3     az  t   n  f  d   x  l   0  0  0  0  0  0  0  0  0  0
4     az  v   n  f  d   h  d   0  0  0  0  1  0  0  0  0  0
...   .. ..  .. .. ..  .. ..  .. .. .. .. .. .. .. .. .. ..
4204  ak  s  as  c  d  aa  d   0  1  0  0  0  0  0  0  0  0
4205   j  o   t  d  d  aa  h   0  0  0  0  0  0  0  0  0  1
4206  ak  v   r  a  d  aa  g   0  0  0  0  1  0  0  0  0  0
4207  al  r   e  f  d  aa  l   0  0  0  0  0  1  0  0  0  0
4208   z  r  ae  c  d  aa  g   0  0  0  0  0  1  0  0  0  0

[4209 rows x 17 columns]

In [ ]:
df[['X1']]

     X1
0     v
1     t
2     w
3     t
4     v
...  ..
4204  s
4205  o
4206  v
4207  r
4208  r

[4209 rows x 1 columns]

In [ ]:
df[lst_10]

      aa  s  b  l  v  r  i  a  c  o
0      0  0  0  0  1  0  0  0  0  0
1      0  0  0  0  0  0  0  0  0  0
2      0  0  0  0  0  0  0  0  0  0
3      0  0  0  0  0  0  0  0  0  0
4      0  0  0  0  1  0  0  0  0  0
...   .. .. .. .. .. .. .. .. .. ..
4204   0  1  0  0  0  0  0  0  0  0
4205   0  0  0  0  0  0  0  0  0  1
4206   0  0  0  0  1  0  0  0  0  0
4207   0  0  0  0  0  1  0  0  0  0
4208   0  0  0  0  0  1  0  0  0  0

[4209 rows x 10 columns]

In [ ]:
lst_10.append('X1')

In [ ]:
df[lst_10]

      aa  s  b  l  v  r  i  a  c  o X1
0      0  0  0  0  1  0  0  0  0  0  v
1      0  0  0  0  0  0  0  0  0  0  t
2      0  0  0  0  0  0  0  0  0  0  w
3      0  0  0  0  0  0  0  0  0  0  t
4      0  0  0  0  1  0  0  0  0  0  v
...   .. .. .. .. .. .. .. .. .. .. ..
4204   0  1  0  0  0  0  0  0  0  0  s
4205   0  0  0  0  0  0  0  0  0  1  o
4206   0  0  0  0  1  0  0  0  0  0  v
4207   0  0  0  0  0  1  0  0  0  0  r
4208   0  0  0  0  0  1  0  0  0  0  r

[4209 rows x 11 columns]

In [ ]:
df[lst_10].head()

   aa  s  b  l  v  r  i  a  c  o X1
0   0  0  0  0  1  0  0  0  0  0  v
1   0  0  0  0  0  0  0  0  0  0  t
2   0  0  0  0  0  0  0  0  0  0  w
3   0  0  0  0  0  0  0  0  0  0  t
4   0  0  0  0  1  0  0  0  0  0  v

# **2) Ordinal Number Encoding**
# Categories are ordered in such a way that they can be assigned Ranks

In [ ]:
import datetime

In [ ]:
today_date=datetime.datetime.today()

In [ ]:
today_date

datetime.datetime(2021, 2, 15, 19, 20, 17, 165376)

In [ ]:
# Past 15 days data
days=[today_date-datetime.timedelta(x) for x in range(0,15)]

In [ ]:
data=pd.DataFrame(days)
data.columns=['Day']

In [ ]:
data.head()

                         Day
0 2021-02-15 19:20:17.165376
1 2021-02-14 19:20:17.165376
2 2021-02-13 19:20:17.165376
3 2021-02-12 19:20:17.165376
4 2021-02-11 19:20:17.165376

In [ ]:
data['Day'].dt.day_name()

0        Monday
1        Sunday
2      Saturday
3        Friday
4      Thursday
5     Wednesday
6       Tuesday
7        Monday
8        Sunday
9      Saturday
10       Friday
11     Thursday
12    Wednesday
13      Tuesday
14       Monday
Name: Day, dtype: object

In [ ]:
data['Day'].dt.day

0     15
1     14
2     13
3     12
4     11
5     10
6      9
7      8
8      7
9      6
10     5
11     4
12     3
13     2
14     1
Name: Day, dtype: int64

In [ ]:
data['Day'].dt.month

0     2
1     2
2     2
3     2
4     2
5     2
6     2
7     2
8     2
9     2
10    2
11    2
12    2
13    2
14    2
Name: Day, dtype: int64

In [ ]:
data['Day'].dt.minute

0     20
1     20
2     20
3     20
4     20
5     20
6     20
7     20
8     20
9     20
10    20
11    20
12    20
13    20
14    20
Name: Day, dtype: int64

In [ ]:
data['Day'].dt.hour

0     19
1     19
2     19
3     19
4     19
5     19
6     19
7     19
8     19
9     19
10    19
11    19
12    19
13    19
14    19
Name: Day, dtype: int64

In [ ]:
data['Day'].dt.second

0     17
1     17
2     17
3     17
4     17
5     17
6     17
7     17
8     17
9     17
10    17
11    17
12    17
13    17
14    17
Name: Day, dtype: int64

In [ ]:
data['Weekday']=data['Day'].dt.day_name()

In [ ]:
data.head()

                         Day   Weekday
0 2021-02-15 19:20:17.165376    Monday
1 2021-02-14 19:20:17.165376    Sunday
2 2021-02-13 19:20:17.165376  Saturday
3 2021-02-12 19:20:17.165376    Friday
4 2021-02-11 19:20:17.165376  Thursday

In [ ]:
dictionary={'Monday':1,'Tuesday':2,'Wednesday':3,'Thursday':4,'Friday':5,'Saturday':6,'Sunday':7}

In [ ]:
dictionary

{'Friday': 5,
 'Monday': 1,
 'Saturday': 6,
 'Sunday': 7,
 'Thursday': 4,
 'Tuesday': 2,
 'Wednesday': 3}

In [ ]:
data['Weekday_ordinal']=data['Weekday'].map(dictionary)

In [ ]:
data

                          Day    Weekday  Weekday_ordinal
0  2021-02-15 19:20:17.165376     Monday                1
1  2021-02-14 19:20:17.165376     Sunday                7
2  2021-02-13 19:20:17.165376   Saturday                6
3  2021-02-12 19:20:17.165376     Friday                5
4  2021-02-11 19:20:17.165376   Thursday                4
5  2021-02-10 19:20:17.165376  Wednesday                3
6  2021-02-09 19:20:17.165376    Tuesday                2
7  2021-02-08 19:20:17.165376     Monday                1
8  2021-02-07 19:20:17.165376     Sunday                7
9  2021-02-06 19:20:17.165376   Saturday                6
10 2021-02-05 19:20:17.165376     Friday                5
11 2021-02-04 19:20:17.165376   Thursday                4
12 2021-02-03 19:20:17.165376  Wednesday                3
13 2021-02-02 19:20:17.165376    Tuesday                2
14 2021-02-01 19:20:17.165376     Monday                1

# **3) Count Or Frequency Encoding**

In [ ]:
train_set=pd.read_csv("/content/adult-training.csv",header=None,index_col=None)

In [ ]:
train_set.head()

   0                  1       2           3   ...  11  12              13      14
0  39          State-gov   77516   Bachelors  ...   0  40   United-States   <=50K
1  50   Self-emp-not-inc   83311   Bachelors  ...   0  13   United-States   <=50K
2  38            Private  215646     HS-grad  ...   0  40   United-States   <=50K
3  53            Private  234721        11th  ...   0  40   United-States   <=50K
4  28            Private  338409   Bachelors  ...   0  40            Cuba   <=50K

[5 rows x 15 columns]

In [ ]:
train_set[1].unique()

array([' State-gov', ' Self-emp-not-inc', ' Private', ' Federal-gov',
       ' Local-gov', ' ?', ' Self-emp-inc', ' Without-pay',
       ' Never-worked'], dtype=object)

In [ ]:
len(train_set[1].unique())

9

In [ ]:
columns=[1,3,5,6,7,8,9,13]

In [ ]:
train_set=train_set[columns]

In [ ]:
train_set.columns=['Employment','Degree','Status','Designation','family_job','Race','Sex','Country']

In [ ]:
train_set.head()

          Employment      Degree  ...      Sex         Country
0          State-gov   Bachelors  ...     Male   United-States
1   Self-emp-not-inc   Bachelors  ...     Male   United-States
2            Private     HS-grad  ...     Male   United-States
3            Private        11th  ...     Male   United-States
4            Private   Bachelors  ...   Female            Cuba

[5 rows x 8 columns]

In [ ]:
for feature in train_set.columns[:]:
  print(feature,":",len(train_set[feature].unique()),'labels')

Employment : 9 labels
Degree : 16 labels
Status : 7 labels
Designation : 15 labels
family_job : 6 labels
Race : 5 labels
Sex : 2 labels
Country : 42 labels

In [ ]:
train_set['Country'].value_counts()

 United-States                 29170
 Mexico                          643
 ?                               583
 Philippines                     198
 Germany                         137
 Canada                          121
 Puerto-Rico                     114
 El-Salvador                     106
 India                           100
 Cuba                             95
 England                          90
 Jamaica                          81
 South                            80
 China                            75
 Italy                            73
 Dominican-Republic               70
 Vietnam                          67
 Guatemala                        64
 Japan                            62
 Poland                           60
 Columbia                         59
 Taiwan                           51
 Haiti                            44
 Iran                             43
 Portugal                         37
 Nicaragua                        34
 Peru                             31
 Greece                           29
 France                           29
 Ecuador                          28
 Ireland                          24
 Hong                             20
 Trinadad&Tobago                  19
 Cambodia                         19
 Laos                             18
 Thailand                         18
 Yugoslavia                       16
 Outlying-US(Guam-USVI-etc)       14
 Honduras                         13
 Hungary                          13
 Scotland                         12
 Holand-Netherlands                1
Name: Country, dtype: int64

In [ ]:
country_map=train_set['Country'].value_counts().to_dict()

In [ ]:
train_set['Country']=train_set['Country'].map(country_map)

In [ ]:
train_set.head()

          Employment      Degree               Status  ...    Race      Sex Country
0          State-gov   Bachelors        Never-married  ...   White     Male   29170
1   Self-emp-not-inc   Bachelors   Married-civ-spouse  ...   White     Male   29170
2            Private     HS-grad             Divorced  ...   White     Male   29170
3            Private        11th   Married-civ-spouse  ...   Black     Male   29170
4            Private   Bachelors   Married-civ-spouse  ...   Black   Female      95

[5 rows x 8 columns]

# **4) Target Guided Ordinal Encoding**
# i) Ordering the labels according to the target
# ii) Replace the labels by the joint probability of being 1 or 0

In [ ]:
df=pd.read_csv("/content/titanic.csv",usecols=['Cabin','Survived'])

In [ ]:
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [ ]:
df['Cabin'].fillna('Missing',inplace=True)

In [ ]:
df.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [ ]:
df['Cabin']=df['Cabin'].astype(str).str[0]

In [ ]:
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [ ]:
df.Cabin.unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [ ]:
df.groupby(['Cabin'])['Survived'].mean().sort_values()

Cabin
T    0.000000
M    0.299854
A    0.466667
G    0.500000
C    0.593220
F    0.615385
B    0.744681
E    0.750000
D    0.757576
Name: Survived, dtype: float64

In [ ]:
df.groupby(['Cabin'])['Survived'].mean().sort_values().index

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [ ]:
ordinal_labels=df.groupby(['Cabin'])['Survived'].mean().sort_values().index
ordinal_labels

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [ ]:
ordinal_labels2={k:i for i,k in enumerate(ordinal_labels,0)}
ordinal_labels2

{'A': 2, 'B': 6, 'C': 4, 'D': 8, 'E': 7, 'F': 5, 'G': 3, 'M': 1, 'T': 0}

In [ ]:
df['Cabin_ordinal_labels']=df['Cabin'].map(ordinal_labels2)

In [ ]:
df.head()

   Survived Cabin  Cabin_ordinal_labels
0         0     M                     1
1         1     C                     4
2         1     M                     1
3         1     C                     4
4         0     M                     1

# **5) Mean Encoding**

In [ ]:
df.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [ ]:
m_o=df.groupby(['Cabin'])['Survived'].mean().to_dict()

In [ ]:
m_o

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'M': 0.29985443959243085,
 'T': 0.0}

In [ ]:
df['mean_ordinal_encoding']=df['Cabin'].map(m_o)

In [ ]:
df.head()

   Survived Cabin  Cabin_ordinal_labels  mean_ordinal_encoding
0         0     M                     1               0.299854
1         1     C                     4               0.593220
2         1     M                     1               0.299854
3         1     C                     4               0.593220
4         0     M                     1               0.299854

# **6)Probability Ratio Encoding**
# 1) Probability of Survived based on Cabin--- Categorical Feature
# 2) Probability of Not Survived---1-pr(Survived)
# 3) pr(Survived)/pr(Not Survived)
# 4) Dictionary to map Cabin with Probability
# 5) replace with the Categorical Feature

In [ ]:
df=pd.read_csv("/content/titanic.csv",usecols=['Cabin','Survived'])

In [ ]:
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [ ]:
# Replacing NaN with Missing 
df['Cabin'].fillna('Missing',inplace=True)
df.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [ ]:
df['Cabin'].unique()

array(['Missing', 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

In [ ]:
df['Cabin']=df['Cabin'].astype(str).str[0]

In [ ]:
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [ ]:
df.Cabin.unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [ ]:
prob_df=df.groupby(['Cabin'])['Survived'].mean()

In [ ]:
prob_df=pd.DataFrame(prob_df)

In [ ]:
prob_df

       Survived
Cabin
A      0.466667
B      0.744681
C      0.593220
D      0.757576
E      0.750000
F      0.615385
G      0.500000
M      0.299854
T      0.000000

In [ ]:
prob_df['Died']=1-prob_df['Survived']

In [ ]:
prob_df.head()

       Survived      Died
Cabin
A      0.466667  0.533333
B      0.744681  0.255319
C      0.593220  0.406780
D      0.757576  0.242424
E      0.750000  0.250000

In [ ]:
prob_df['Probability_ratio']=prob_df['Survived']/prob_df['Died']

In [ ]:
prob_df.head()

       Survived      Died  Probability_ratio
Cabin
A      0.466667  0.533333           0.875000
B      0.744681  0.255319           2.916667
C      0.593220  0.406780           1.458333
D      0.757576  0.242424           3.125000
E      0.750000  0.250000           3.000000

In [ ]:
probability_encoded=prob_df['Probability_ratio'].to_dict()

In [ ]:
df['Cabin_encoded']=df['Cabin'].map(probability_encoded)

In [ ]:
df.head()

   Survived Cabin  Cabin_encoded
0         0     M       0.428274
1         1     C       1.458333
2         1     M       0.428274
3         1     C       1.458333
4         0     M       0.428274

# **7) Label Encoding**

In [ ]:
import seaborn as sns

In [ ]:
df=sns.load_dataset('tips')
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

# Method 1

In [ ]:
data=pd.get_dummies(df['sex'])

In [ ]:
data=pd.DataFrame(data)

In [ ]:
data.head()

   Male  Female
0     0       1
1     1       0
2     1       0
3     1       0
4     0       1

In [ ]:
df.drop('sex',axis=1)

     total_bill   tip smoker   day    time  size
0         16.99  1.01     No   Sun  Dinner     2
1         10.34  1.66     No   Sun  Dinner     3
2         21.01  3.50     No   Sun  Dinner     3
3         23.68  3.31     No   Sun  Dinner     2
4         24.59  3.61     No   Sun  Dinner     4
..          ...   ...    ...   ...     ...   ...
239       29.03  5.92     No   Sat  Dinner     3
240       27.18  2.00    Yes   Sat  Dinner     2
241       22.67  2.00    Yes   Sat  Dinner     2
242       17.82  1.75     No   Sat  Dinner     2
243       18.78  3.00     No  Thur  Dinner     2

[244 rows x 6 columns]

In [ ]:
df['Male']=data['Male'].to_list()

In [ ]:
df['Female']=data['Female'].to_list()

In [ ]:
df

     total_bill   tip     sex smoker   day    time  size  Male  Female
0         16.99  1.01  Female     No   Sun  Dinner     2     0       1
1         10.34  1.66    Male     No   Sun  Dinner     3     1       0
2         21.01  3.50    Male     No   Sun  Dinner     3     1       0
3         23.68  3.31    Male     No   Sun  Dinner     2     1       0
4         24.59  3.61  Female     No   Sun  Dinner     4     0       1
..          ...   ...     ...    ...   ...     ...   ...   ...     ...
239       29.03  5.92    Male     No   Sat  Dinner     3     1       0
240       27.18  2.00  Female    Yes   Sat  Dinner     2     0       1
241       22.67  2.00    Male    Yes   Sat  Dinner     2     1       0
242       17.82  1.75    Male     No   Sat  Dinner     2     1       0
243       18.78  3.00  Female     No  Thur  Dinner     2     0       1

[244 rows x 9 columns]

In [ ]:
df.head()

   total_bill   tip     sex smoker  day    time  size  Male  Female
0       16.99  1.01  Female     No  Sun  Dinner     2     0       1
1       10.34  1.66    Male     No  Sun  Dinner     3     1       0
2       21.01  3.50    Male     No  Sun  Dinner     3     1       0
3       23.68  3.31    Male     No  Sun  Dinner     2     1       0
4       24.59  3.61  Female     No  Sun  Dinner     4     0       1

# Method2

In [ ]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
label=le.fit_transform(df["sex"])

In [ ]:
le.classes_

array(['Female', 'Male'], dtype=object)

In [ ]:
label

array([0, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 0, 1, 1, 0, 1, 0, 1, 0, 1, 1, 0,
       0, 1, 1, 1, 1, 1, 1, 0, 1, 1, 0, 0, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1,
       0, 0, 1, 1, 1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 1, 0, 1, 1,
       1, 1, 1, 1, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0,
       1, 0, 1, 1, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 1, 0, 0, 1, 1, 0,
       0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1,
       1, 0, 1, 0, 0, 1, 1, 1, 0, 1, 0, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1,
       1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 0, 1, 1, 1, 1, 1, 0,
       0, 1, 1, 0, 0, 0, 1, 0, 1, 1, 1, 0, 1, 1, 1, 0, 0, 0, 1, 1, 1, 0,
       1, 0, 1, 0, 1, 0, 0, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1,
       1, 0])

In [ ]:
Data=df.drop("sex",axis='columns')

In [ ]:
Data

     total_bill   tip smoker   day    time  size  Male  Female
0         16.99  1.01     No   Sun  Dinner     2     0       1
1         10.34  1.66     No   Sun  Dinner     3     1       0
2         21.01  3.50     No   Sun  Dinner     3     1       0
3         23.68  3.31     No   Sun  Dinner     2     1       0
4         24.59  3.61     No   Sun  Dinner     4     0       1
..          ...   ...    ...   ...     ...   ...   ...     ...
239       29.03  5.92     No   Sat  Dinner     3     1       0
240       27.18  2.00    Yes   Sat  Dinner     2     0       1
241       22.67  2.00    Yes   Sat  Dinner     2     1       0
242       17.82  1.75     No   Sat  Dinner     2     1       0
243       18.78  3.00     No  Thur  Dinner     2     0       1

[244 rows x 8 columns]

In [ ]:
Data.head()

   total_bill   tip smoker  day    time  size  Male  Female
0       16.99  1.01     No  Sun  Dinner     2     0       1
1       10.34  1.66     No  Sun  Dinner     3     1       0
2       21.01  3.50     No  Sun  Dinner     3     1       0
3       23.68  3.31     No  Sun  Dinner     2     1       0
4       24.59  3.61     No  Sun  Dinner     4     0       1